#ifndef __BSP_TIM_H 
#define __BSP_TIM_H 
/*----------------------------------include-----------------------------------*/
#include "stm32f4xx.h"
#include "ProConfig.h"
/*----------------------------------macro-------------------------------------*/

/*ÖØ¼ÓÔØ¼Ä´æÆ÷Öµ*/
#define TIM6_RELOAD_VALUE 1000000/LOOP_MAIN_LOOP



/*----------------------------------function----------------------------------*/
void tim_init(void);
/*----------------------------------variable----------------------------------*/

#endif	/* __BSP_TIM_H */



