/**
  ******************************************************************************
  * @file    globle.h
  * @author  kai
  * @version V1.0.0
  * @data    2025/04/03
  * @brief   
  ******************************************************************************
  * @attention
  *
  * 
  *
  ******************************************************************************
  */
/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __GLOBLE_H
#define __GLOBLE_H
/* Includes ------------------------------------------------------------------*/
#include "stm32f10x.h"
/* Exported define ------------------------------------------------------------*/
/* Exported types ------------------------------------------------------------*/
/* Exported macro ------------------------------------------------------------*/
/*sbus通道数*/
#define SBUS_INPUT_CHANNELS             25
/*解码后的pwm通道数*/
#define SBUS_PWM_CHANNELS               16
/* Exported contants --------------------------------------------------------*/
extern uint8_t sbus_DF_TC;/*一个数据帧(data frame)传输完成标志*/
extern uint8_t sbus_buff[2][SBUS_INPUT_CHANNELS]; /*多缓冲区,防止解码时数据被覆盖*/
extern uint8_t active_buff;/*接收缓冲区指针*/
/* Exported functions ------------------------------------------------------- */
#endif /* __GLOBLE_H */
