/**
  ******************************************************************************
  * @file    com_data.c
  * @author  kai
  * @version V1.0.0
  * @data    2025/07/21
  * @brief   存放项目需要使用的全局变量、数据类型
  ******************************************************************************
  * @attention
  *
  * 存放的数据类型应该是项目专用,更通用的数据类型在pro_common.h中
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "com_data.h"

/** @addtogroup Drone_F427
* @{
*/ 


// /*遥控器数据(9通道)*/
// __IO rc_data_t rc_data;
// /*归一化映射后的遥控器数据(9通道)*/
// __IO rc_data_norm_t rc_data_norm;
/*遥控数据处理总结构体*/
volatile rc_state_t rc_state;

/**********************************飞行控制数据******************************************/
volatile Flight_Control_State_t flight_control_state;


/**
  * @}
  */ 

