/**
 * *****************************************************************************
 * @file        main.c
 * @brief       独立模式多通道ADC实验，使用DMA转移规则组数据寄存器数据
 * @author
 * @date        2024-12-05
 * @version
 * @copyright
 * *****************************************************************************
 * @attention
 *
 * 实验平台:
 *
 * *****************************************************************************
 */

/*----------------------------------include-----------------------------------*/
#include "stm32f10x.h"
#include "OLED.h"
#include "bsp_usart.h"
#include "bsp_systick.h"
#include "bsp_iic.h"
/*----------------------------------------------------------------------------*/
int main(void)
{
    OLED_Init();
    uint8_t ret;
    SysTick_Init(72);
    IICInit();
    ret=test();
    OLED_ShowNum(0, 0, ret, 4, OLED_8X16);
    OLED_Update();
    while (1)
    {

    }
}
