/**
 ******************************************************************************
 * @file    ringbuff.c
 * @author  kai
 * @version V1.0.0
 * @data    2025/04/10
 * @brief   环形缓冲区
 ******************************************************************************
 * @attention
 *
 *
 *
 ******************************************************************************
 */
/* Includes ------------------------------------------------------------------*/
#include "ringbuff.h"

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/

/**
 * @brief  环形缓冲区初始化
 * @note
 * @param  buff:缓冲区头指针
 * @param  len：缓冲区大小
 * @param  rb_t：缓冲区结构体
 * @retval 无
 */
void rb_init(uint8_t *buff, uint32_t len, ringbuff_t *rb)
{
    rb->pbuff = buff;
    rb->pend = buff + len;
    rb->pr = buff;
    rb->pw = buff;
	rb->length = len;
    rb->overflow = RESET;
}



